app/controllers/every_pays_controller.rb

SELECT "every_pays".* FROM "every_pays"
---
  def index
    @every_pays = EveryPay.all

INSERT INTO "every_pays" ("status", "amount", "payment_reference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def payment_success
    gateway=set_every_data
    payment_response = gateway.result(payment_reference: params[:payment_reference])
    EveryPay.create status: payment_response.params['payment_state'] ,amount: payment_response.params['initial_amount'] , payment_reference: params[:payment_reference]